# Дана шахматная доска 8×8. Задача определить сколько черных фигур стоит на белых полях?
# Сколько белых фигур стоит на черных полях? Сколько фигур стоит на своих полях?

import numpy as np

n = 8

# Матрица цвета клеток: 1 = белая клетка, -1 = черная клетка
M1 = np.tile(np.array([[-1, 1], [1, -1]]), (4, 4))
print("Цвет клеток (M1):\n", M1)

# Матрица фигур: 1 = белая фигура, -1 = черная фигура, 0 = пусто
M2 = np.random.randint(-1, 2, (n, n))
print("Фигуры (M2):\n", M2)


X1 = 0  # белые фигуры на черных
X2 = 0  # черные фигуры на белых
X3 = 0  # фигуры на своем цвете

for i in range(n):
    for j in range(n):
        if M2[i, j] == 0:
            continue  # пустая клетка, пропускаем
        if M1[i, j] * M2[i, j] == 1:
            X3 += 1  # фигура на своем цвете
        elif M1[i, j] == -1 and M2[i, j] == 1:
            X1 += 1  # белая фигура на черном
        elif M1[i, j] == 1 and M2[i, j] == -1:
            X2 += 1  # черная фигура на белом

print(f"Белые фигуры на черных полях: {X1}")
print(f"Черные фигуры на белых полях: {X2}")
print(f"Фигуры на своем цвете: {X3}")